//* TODO: 30 ноября 2018 г. - 17:42 (Андреев М.А.)
//Необходим рефакторинг: Журнал событий не должен принимать в качестве параметров структуру
//Все таки я думаю реализовать через запись информации в поток и сохранение потока в файл.
//Подумать над форматом: предположительно JSON, контроль логов можно осуществлять стеком ELK.


// Создается запись в журнале
//
// Параметры:
//  СтруктураПараметров  - Структура с полями РС
//  		
Процедура ДобавитьСобытие(СтруктураПараметров)
	

КонецПроцедуры // ДобавитьСобытие()

Процедура ЗаписатьСобытие(СтруктураПараметров, ТипСобытия, ДатаСеанса, Описание) Экспорт
	//Если ТипСобытия = УровеньЖурналаРегистрации.Информация И НЕ СтруктураПараметров.РежимОтладки Тогда
	//	Возврат;
	//КонецЕсли;
	
	ПараметрыСобытия = Новый Структура();
	ПараметрыСобытия.Вставить("ДатаСобытия",ДатаСеанса);
	ПараметрыСобытия.Вставить("ТипСобытия",ТипСобытия);
	ПараметрыСобытия.Вставить("Описание",Описание);
	//* TODO: 24 сентября 2018 г. - 17:50 (Андреев М.А.)
	//Не нравится текущая реализация, но пока оставил так, до рефакторинга	
	СтруктураПараметров.ЖурналМенеджераПотоков.Добавить(ПараметрыСобытия);
	//ДобавитьСобытие(Параметры, СтруктураПараметров);
КонецПроцедуры

// Создается запись в журнале
//
// Параметры:
//  СтруктураПараметров  - Структура с параметрами инициализации
Процедура СохранитьЖурналВРеестрМенеджераПотоков(СтруктураПараметров) Экспорт
	
	НаборЗаписей = РегистрыСведений.ДанныеМенеджераПотоков.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ИдентификаторМенеджера.Установить(СтруктураПараметров.ИдентификаторМенеджера);
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() = 0 Тогда
		//Необходимо сказать о том что произошла ошибка записи в реестр менеджера потока 
		СохранитьВЖурналРегистрации(СтруктураПараметров);
		Возврат;
	КонецЕсли;
	НаборЗаписей[0].ЖурналМенеджера = Новый ХранилищеЗначения(СтруктураПараметров.ЖурналМенеджераПотоков);
	
	Попытка
		НаборЗаписей.Записать();
	Исключение
		СохранитьВЖурналРегистрации(СтруктураПараметров);
		Возврат;
	КонецПопытки;
КонецПроцедуры

Процедура СохранитьВЖурналРегистрации(СтруктураПараметров) Экспорт
  //* TODO: 24 сентября 2018 г. - 18:14 (Андреев М.А.)
  //Не нравится то что не указать дату 
  МассивСообщений = СтруктураПараметров.ЖурналМенеджераПотоков;
  Для каждого ЗаписьЖурнала Из МассивСообщений Цикл
	  ЗаписьЖурналаРегистрации("Менеджер потоков: {"+СтруктураПараметров.ИдентификаторМенеджера+"}",ЗаписьЖурнала.ТипСобытия,Метаданные.Обработки.МенеджерФоновыхЗаданий,, ЗаписьЖурнала.Описание)
  КонецЦикла; 
  //ЗаписьЖурналаРегистрации(<ИмяСобытия>, <Уровень>, <ОбъектМетаданных>, <Данные>, <Комментарий>, <РежимТранзакции>)
КонецПроцедуры



//    ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ

Процедура ЗаписатьОшибку(СтруктураПараметров, ТекстОшибки) Экспорт
	ЗаписатьСобытие(СтруктураПараметров, УровеньЖурналаРегистрации.Ошибка, ТекущаяДатаСеанса(), ТекстОшибки);
КонецПроцедуры

Процедура ЗаписатьСообщение(СтруктураПараметров, ТекстСообщения) Экспорт
	ЗаписатьСобытие(СтруктураПараметров, УровеньЖурналаРегистрации.Информация, ТекущаяДатаСеанса(), ТекстСообщения);
КонецПроцедуры

Процедура ЗаписатьПредупреждение(СтруктураПараметров, ТекстСообщения) Экспорт
	ЗаписатьСобытие(СтруктураПараметров, УровеньЖурналаРегистрации.Предупреждение, ТекущаяДатаСеанса(), ТекстСообщения);
КонецПроцедуры
